OdGsDevice.setUpdateManager(OdSmartPtr&lt;OdGsUpdateManager&gt;)
\details
Associates OdGsUpdateManager with device
\param pManager [in] Pointer to the OdGsUpdateManager

OdGsDevice.getUpdateManager(System.Boolean)
\details
Returns OdGsUpdateManager associated with current device
\param createIfNotExist [in] Creates instance of OdGsUpdateManager if no one associated with device

OdGsDevice.getSnapShot(OdSmartPtr&lt;OdGiRasterImage&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns image of current device buffer.
\param pImage [out]  Pointer for image to return.
\param region [in]  Rectangle specifies region to return.
\remarks
Implementation can throw eNotImplementedYet exception if current vectorization module doesn't support snap shots.

OdGsDevice.getLogicalPalette(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the logical pallete used by this Device object.
\param numColors [out]  Number of colors in palette.

OdGsDevice.setLogicalPalette(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*,System.Int32)
\details
Sets the logical pallete to be used by this Device object.
\param logicalPalette [in]  Logical palette.
\param numColors [in]  Number of colors in palette.
\remarks
The logical pallete is used with calls to OdGiSubEntityTraits::setColor().

OdGsDevice.getBackgroundColor
\details
Returns the Background Color of the GUI window of this Device object.

OdGsDevice.setBackgroundColor(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the Background Color of the GUI window of this Device object.
\param backgroundColor [in]  Background color.

OdGsDevice.viewAt(System.Int32)
\details
Returns the specified OdGsView object associated with this Device object.
\param viewIndex [in]  View index.

OdGsDevice.numViews
\details
Returns the number of views associated with this Device object.

OdGsDevice.eraseAllViews
\details
Erases all views associated with this Device object.

OdGsDevice.eraseView(System.Int32)
\details
Erases the specified View object.
\param viewIndex [in]  View index.
\returns
Returns true if and only if successful.

OdGsDevice.eraseView(OdGsView*)
\details
Erases the specified View object.
\param pView [in]  Pointer to the OdGsView object.
\returns
Returns true if and only if successful.

OdGsDevice.insertView(System.Int32,OdGsView*)
\details
Inserts the specified Viewport object to the specified position in this Device object.
\param viewIndex [in]  View index.
\param pView [in]  Pointer to the OdGsView object.

OdGsDevice.gsFilerDeviceInterface
\details
Returns interface for graphics cache loading/saving using OdGsFiler.
\returns
interface object pointer in case if it is supported by device, or nullptr otherwise.

OdGsDevice.loadDeviceState(OdGsFilerGSS*)
\details
Restores device state from filer object.
\param pFiler [in]  Filer object.
\returns
true if device state is successfully loaded, false if device state loading is not supported.

OdGsDevice.saveDeviceState(OdGsFilerGSS*)
\details
Stores current device state into filer object.
\param pFiler [out]  Filer object.
\returns
true if device state is successfully saved, false if device state saving is not supported.

OdGsDevice.isModelCompatible(OdGsModel*)
\details
Checks compatibility between specified OdGsModel and this Device object.
\param pModel [in]  Model object pointer to check compatibility.
\returns
true if the provided model is compatible with this device, false otherwise.
\remarks
Use this method to check compatibility of exist Model object and newly created device
to be sure the exist Model object could be used with this Device object.
By default this always returns false. It is must be implemented in inherited classes
to enable Model object reuse support. If Device object use overriden Model object
it should return false if input Model object doesn't overriden.
Typical way to check compatibility is using of RTTI.
If your metafiles cache doesn't support per-device sharing override and return false.

OdGsDevice.createModel
\details
Creates a new OdGsModel object, and associates it with this Device object.
\returns
Returns a SmartPointer to the newly created object.

OdGsDevice.addView(OdGsView*)
\details
Associates the specified Viewport object with this Device object.
\param pView [in]  Pointer to the OdGsView object.

OdGsDevice.createView(OdGsClientViewInfo!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Creates a new OdGsView object, and associates it with this Device object.
\param pViewInfo [in]  Pointer to the Client View Information for this Device object.
\param enableLayerVisibilityPerView [in]  Layer visibility per viewport is supported, if and only if true.
\returns
Returns a SmartPointer to the newly created object.
pViewInfo contains information returned by OdGiViewport::acadWindowId() and OdGiViewportDraw::viewportObjectId()

OdGsDevice.onDisplayChange(System.Int32,System.Int32,System.Int32)
\details
Notification function called whenever the OS screen resolution and/or color depth have changed.
\param bitsPerPixel [in]  Color depth.
\param xPixels [in]  X pixels.
\param yPixels [in]  Y pixels.
\remarks
This function is called after the operation.

OdGsDevice.onRealizeBackgroundPalette
\details
Notification function typically called whenever the GUI window for this Device object loses focus.
\remarks
Causes this Device object to realize its background palette.

OdGsDevice.onRealizeForegroundPalette
\details
\remarks
Causes this Device object to realize its foreground palette.

OdGsDevice.getSize(OdGsDCRectDouble*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns device surface output rectangle.
\param outputRect [out]  Obtains size of the output rectangle in device coordinates (pixels).

OdGsDevice.getSize(OdGsDCRect*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns device surface output rectangle.
\param outputRect [out]  Obtains size of the output rectangle in device coordinates (pixels).

OdGsDevice.onSize(OdGsDCRectDouble!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Notification function called whenever the size of the GUI window for this Device object has changed.
\param outputRect [in]  New size of the output rectangle in device coordinates (pixels).
\remarks
This function should not be called if this Device object has a width and/or height of 0, .

OdGsDevice.onSize(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Notification function called whenever the size of the GUI window for this Device object has changed.
\param outputRect [in]  New size of the output rectangle in device coordinates (pixels).
\remarks
This function should not be called if this Device object has a width and/or height of 0, .

OdGsDevice.update(OdGsDCRect*)
\details
Updates the GUI window for this Device object.
\param pUpdatedRect [out]  Pointer to the a rectangle to receive the region updated by this function.
\remarks
This function call is propagated to all OdGsView objects owned by this Device object,
thus displaying the correct image on the GUI window of this Device object.

OdGsDevice.isValid
\details
Checks whether the GUI window for this Device object is showing the correct image.
\returns
true if the GUI window for this Device object is showing the correct image, false otherwise.
\remarks
This implies the following:
* No part of GUI area is flagged for refresh.
* All rasterizations are complete
* The rendering pipeline has been flushed.

OdGsDevice.invalidate(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Marks for refresh the specified region of the GUI window of this Device object.
\param screenRect [in]  Rectangular area.

OdGsDevice.invalidate
\details
Marks for refresh entire region of the GUI window of this Device object.

OdGsDevice.setUserGiContext(OdGiContext*)
\details
Sets the User Context object associated with this Device object.
\param pUserGiContext [in]  Pointer to the User Context.

OdGsDevice.userGiContext
\details
Returns the User Context object associated with this Device object.